#include <Servo.h>

Servo servo;//サーボのインスタンス

void setup(){
  //サーボの信号線を３番ピンに接続
  //（PWMピン以外のピンにも接続可）
  servo.attach(3);
}

void loop(){
  //サーボ出力
  
  // 最初のインクリメントで0にあわせる
  static int deg = -1;
  if (360 < deg) {
    // 360よりも大きくなったら0にもどす
    deg = 0;
  } else {
    // 360以下のときは360まで1ずつ増やす
    deg += 1;
  }
  
  ///!!!!!!!!!!///
  // コインドーザーの基本周期は5秒
  // 180度の回転ごとに5秒間まつ
  ///!!!!!!!!!!///
  if (deg == 180 || deg == 360) delay(5000);
  
  // loop函数はとてつもない頻度で呼ばれるので1msecくらいまつ
  // これがないとサーボが痙攣みたいな動きをする
  delay(1);
  
  // 0 〜 180 という値を 0 => 180 => 0 => 180 と往復
  // 往復の往路なのか復路なのかという情報のかわりに180で折り返す理論
  servo.write(deg <= 180 ? deg : 360 - deg);
}

